In [1]:
import pandas as pd ## to craete dataframes we need to import this pandas librarary

In [2]:
# how to create a dataframe from dictionary and list also ??

In [3]:
d1 = {'name':["raj", "ramesh","mary", "sachin"], 'Age':[23,32,46,25], 'height':[190,170,165,156]}

In [4]:
d1

{'name': ['raj', 'ramesh', 'mary', 'sachin'],
 'Age': [23, 32, 46, 25],
 'height': [190, 170, 165, 156]}

In [5]:
df1 = pd.DataFrame(d1) ## here we are using pd.dataframe to create data frane of df1
df1

     name  Age  height
0     raj   23     190
1  ramesh   32     170
2    mary   46     165
3  sachin   25     156

In [6]:
# how to create a dataframe from list  ??

In [7]:
L1 = ["raj", "ramesh","mary", "sachin"]
L2 =  [23,32,46,25]
L3 = [190,170,165,156]

In [8]:
df2 = pd.DataFrame(zip(L1, L2,L3)) ###zip function will concludes each list in a single columns or rows
df2

        0   1    2
0     raj  23  190
1  ramesh  32  170
2    mary  46  165
3  sachin  25  156

In [9]:
df2 = pd.DataFrame(zip(L1, L2,L3), columns = ['Name', 'Age',"Height"]) 
df2

     Name  Age  Height
0     raj   23     190
1  ramesh   32     170
2    mary   46     165
3  sachin   25     156

In [10]:
## INDEXING OF COLUMN AND ROWS STARTS WITH "ZERO"

In [11]:
df1.columns

Index(['name', 'Age', 'height'], dtype='object')

In [12]:
type(df1)

pandas.core.frame.DataFrame

In [13]:
len(df1)

4

In [14]:
df1.shape

(4, 3)

# DATAFRAME

In [15]:
import pandas as pd

In [16]:
##HOW TO OEN WEBBROWSER FROM JUPITER

In [17]:
import webbrowser

In [18]:
url = 'https://pandas.pydata.org/docs/'

In [19]:
webbrowser.open(url) ## TO OpEN WEBBROWSER

True

In [20]:
## TO OPEN AN EXCEL FILE OR CSV (COMMA SEPERATED VALUE) FILE

In [21]:
import pandas as pd

df =pd.read_csv(r"C:\Users\User\Desktop\python classes\Salaries.csv") ### to import csv file from different directory as of jupiter notebook

In [22]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [23]:
import pandas as pd

df =pd.read_csv("Salaries.csv") ## to import csv file from same directory as of jupiter notebook

In [24]:
dfxcel = pd.read_excel(r"C:\Users\User\Desktop\python classes\Salaries.xlsx") ## to import excel file
dfxcel

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [25]:
## dfxcel = pd.BooleanDtype("Salaries.csv") ## presing tab after " df= pd." can give you num of types to know the data

In [26]:
## if text file name is " ex.txt ", then you can call it by command df = pd.read_csv("ex.txt")

In [27]:
import pandas as pd

In [28]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [29]:
## rows , records, observations are synonyms of rows 
## and colum or features or attributes

In [30]:
df.head(7)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [31]:
df.tail(5) ## last 5 rows

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [32]:
data frame= it is 2d heterogenous data structure = rows and colums,here rank and sex is in string dtatype,

SyntaxError: invalid decimal literal (142304676.py, line 1)

In [ ]:
df.info() ## to know the info of data types and its entries "NaN" is null or missing value

In [ ]:
df.shape,len(df)

In [ ]:
len(df)

In [ ]:
df.columns

# Creating Dataframes using numpy and dictionaries

In [ ]:
list1 =[10,20,30,40,50,60]b
list2 = ["a","b"]
s1 = pd.Series(list1)
s1   ## it wll give a list of specific objects(any data type) in series with its index values

In [ ]:
### summary :
import pandas as pd, create a df using dictionary, or create a df using lists, add a column
# se read_csv to read csv data into pandas df, use read_excel, df.info, df.tail, df.shape, lin (df),etc

In [ ]:
## TO SUBSET AND TO SEE ONLY FEW COLUMNS

In [ ]:
df[["rank","service", "phd"]]  ## these are all considered to be in list of columns, so in  square brackets

In [ ]:
df[["rank","service", "phd"]].tail(10)

In [ ]:
df[["rank","service", "phd"]].head(5) ## top 5 rows of these

In [ ]:
to subset the data using iloc i.e  index location .....df.iloc[rows, columns]

In [ ]:
df.iloc[10:16,2:4]

In [ ]:
df.iloc[0:10, 0:3]

In [ ]:
df.iloc[10:,3:] ## itconsider all the rows from 10 and all the columns from 3rd

In [ ]:
df.iloc[10:100,3:10] ### even if u give num morethan the num of columns and rows, then also it will consider upto the end of rows and columns

In [ ]:
df.iloc[:,:] ## gives all rows and columns

In [ ]:
## to get specific rows and specific columns

In [ ]:
df.iloc[[5,8,10,18], [0,1,3,5]]

In [ ]:
df.iloc[[10,20,30], [1,2,5]]

In [ ]:
df.loc[1:4, "phd"]  ### to get specific values of phd from 1 to 4

In [ ]:
### To create range of row index values of speific column names
df.loc[1:4, "discipline":"salary"]### here column names are giving from dicipline to salary

In [ ]:
df.loc[1:4, "discipline":"salary"]

In [ ]:
df.iloc[1:4, 5] ##  iloc gives u based on its num indexing

In [ ]:
df.loc[1:10, :]

# numpy

In [ ]:
numpy helps in arrangement of data in 1D or 2D or 3D OR nD

In [ ]:
import numpy as np

In [ ]:
b= np.array([1,2,3]) ## 1DIMENSION OF ARRAY or   a1 =[1,2,3]
b

In [ ]:
print(b.shape)

In [ ]:
c= np.array([(1,2,3),(4,5,6)]) ## its 2D array a1= [(1,2,3),(4,5,6)]
c

In [ ]:
a = np.array([(1,2,3,9),(4,5,6,8),(7,8,9,8)]) ## its 3D array a1= [(1,2,3),(4,5,6),(7,8,9)]
a

In [ ]:
a= a.reshape(4,3) ### so we can reshape the rows intp columns or columns into rows
a

In [ ]:
a = np.array([[1,2,3],[4,5,6],[7,8,9]])  ## so, tuple() or list[] both can be represented in array 
a

In [ ]:
print(a.shape)

In [ ]:
print(a.size) ## num of elements

In [ ]:
d = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])   
d

In [ ]:
d= d.reshape(3,4)

In [ ]:
d

In [ ]:
e = np.array([[1,2,3,6],[4,5,6,11],[7,8,9,19],[10,11,12,21]])   
e

In [ ]:
e = e.reshape(4,4)
e

In [ ]:
we can convert numeric of data frame values into array of values(2D or 3D)

In [ ]:
z =np.array([(1,2,3,4),(5,6,7,8)])
z[1] ## accessing values of specific index. here 0th index counts(1,2,3,4) and 1st index counts(5,6,7,8) and so on

In [ ]:
z[1][2]  ##

In [ ]:
z= np.array([1,2,3,4])
print(z.sum())

In [ ]:
z.min()

In [ ]:
z.max()

In [ ]:
z.sum()

In [ ]:
z =np.array([(1,2,3,4),(5,6,7,8)])
z

In [33]:
z.sum(axis=0) ## sum of vertical columns

NameError: name 'z' is not defined

In [ ]:
z.sum(axis=1) ## sum of horizontal rows

# DATA RETRIEVAL OR DATA GROUPING OR SORTING IN NUMPY OR PANDAS

In [35]:
import pandas as pd
df = pd.read_csv("Salaries.csv")

In [36]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [37]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [38]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [39]:
df.dtypes ## gives info

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [42]:
df.sort_index()

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]